Revit 2027 API
IFCCategoryTemplate.SetMappingInfo(IDictionary<ExportIFCCategoryKey, ExportIFCCategoryInfo>) Method
 Set the mapping info for multiple keys.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetMappingInfo(
	IDictionary<ExportIFCCategoryKey, ExportIFCCategoryInfo> newMap
)
Public Sub SetMappingInfo (
	newMap As IDictionary(Of ExportIFCCategoryKey, ExportIFCCategoryInfo)
)
public:
void SetMappingInfo(
	IDictionary<ExportIFCCategoryKey^, ExportIFCCategoryInfo^>^ newMap
)
member SetMappingInfo :
        newMap : IDictionary<ExportIFCCategoryKey, ExportIFCCategoryInfo> -> unit
Parameters
newMap IDictionary<ExportIFCCategoryKey, ExportIFCCategoryInfo>
 The updated map.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCCategoryTemplate Class
SetMappingInfo Overload
Autodesk.Revit.DB Namespace